examples/dfLowMachFoam/oneD_freelyPropagation/C2H4/pytorchIntegrator/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.62 0 0);

boundaryField
{
    boundary
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1.62 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
